Revit 2027 API
StructuralSection.GetBoundarySize Method
 Returns size of the section boundary.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV GetBoundarySize()
Public Function GetBoundarySize As UV
public:
UV^ GetBoundarySize()
member GetBoundarySize : unit -> UV
Return Value
UV
 Size of the section boundary.
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace